init-before.el
(defvar normal-global-leader-key "SPC")
(defvar non-normal-leader-key "<f18>")
(defvar normal-major-mode-leader-key ",")
(defvar non-normal-major-mode-leader-key "<f19>")

(require 'package)
(add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t)
(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

(unless (package-installed-p 'use-package)
  (package-refresh-contents)
  (package-install 'use-package))
(eval-and-compile
  (setq use-package-always-ensure t) 
  (setq use-package-always-defer nil)
  (setq use-package-always-demand t)
  (setq use-package-expand-minimally t)
  (setq use-package-verbose t))

(unless (package-installed-p 'quelpa)
  (with-temp-buffer
    (url-insert-file-contents "https://raw.githubusercontent.com/quelpa/quelpa/master/quelpa.el")
    (eval-buffer)
    (quelpa-self-upgrade)))
(package-install 'auctex)

(use-package doom-themes
  :ensure t
  :config
  ;; Global settings (defaults)
  (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
	doom-themes-enable-italic t) ; if nil, italics is universally disabled
  (load-theme 'doom-one t)

  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)

  ;; Enable custom neotree theme (all-the-icons must be installed!)
  (doom-themes-neotree-config)
  ;; or for treemacs users
  (setq doom-themes-treemacs-theme "doom-colors") ; use the colorful treemacs theme
  (doom-themes-treemacs-config)

  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))

(use-package smartparens
  :config
  (require 'smartparens-config)
  (smartparens-global-mode)
  )

(defun herl/evil-colemak-setup ()
  (interactive)
  (define-key evil-motion-state-map (kbd "h") 'evil-backward-char)
  (define-key evil-motion-state-map (kbd "n") 'evil-next-visual-line)
  (define-key evil-motion-state-map (kbd "e") 'evil-previous-visual-line)
  (define-key evil-motion-state-map (kbd "i") 'evil-forward-char)
  (define-key evil-normal-state-map (kbd "i") 'evil-forward-char)
  (define-key evil-visual-state-map (kbd "i") 'evil-forward-char)
  (define-key evil-normal-state-map (kbd "s") 'evil-insert)
  (define-key evil-normal-state-map (kbd "t") 'evil-append)
  (define-key evil-visual-state-map (kbd "c") 'evil-yank)
  (define-key evil-normal-state-map (kbd "v") 'evil-paste-after)
  (define-key evil-normal-state-map (kbd "a") 'evil-visual-char)
  (define-key evil-normal-state-map (kbd "x") 'evil-delete)
  (define-key evil-normal-state-map (kbd "X") 'evil-delete-line)
  (define-key evil-normal-state-map (kbd "z") 'evil-undo)
  (define-key evil-normal-state-map (kbd "u") 'evil-forward-word-begin)
  (define-key evil-normal-state-map (kbd "l") 'evil-backward-word-begin)
  (define-key evil-motion-state-map (kbd "C-w h") 'evil-window-left)
  (define-key evil-motion-state-map (kbd "C-w n") 'evil-window-down)
  (define-key evil-motion-state-map (kbd "C-w e") 'evil-window-up)
  (define-key evil-motion-state-map (kbd "C-w i") 'evil-window-right)
  (define-key evil-insert-state-map (kbd "C-e") 'move-end-of-line)
  (define-key evil-insert-state-map (kbd "C-a") 'move-beginning-of-line)
  )

(use-package evil
  :ensure t ;; install the evil package if not installed
  :init ;; tweak evil's configuration before loading it
  (setq evil-search-module 'evil-search)
  (setq evil-ex-complete-emacs-commands nil)
  (setq evil-vsplit-window-right t)
  (setq evil-split-window-below t)
  (setq evil-shift-round nil)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil)
  :config ;; tweak evil after loading it
  (evil-mode)
  ;; convert key map for colemake
  (herl/evil-colemak-setup)
  )

(use-package evil-collection
  :config
  (evil-collection-init))

(message "evil inited!")

(use-package helm
  :config
  (require 'helm-config)
  (helm-autoresize-mode 1)
  (setq helm-autoresize-max-height 50)
  (setq helm-autoresize-min-height 15)
  :bind
  ("M-x" . helm-M-x)
  ("C-x C-f" . helm-find-files)
  ("C-x C-b" . helm-mini)
  ("M-y" . helm-show-kill-ring)
  )

(message "helm inited!")

(use-package which-key
  :config
  (which-key-mode)
  (setq which-key-idle-secondary-delay 0.5)
  )
(message "which key inited!")

(use-package general :ensure t
  :config
  (defun herl-open-emacs-org()
    (interactive)
    (find-file "~/.emacs.d/Emacs.org"))
  (general-override-mode)
  (general-evil-setup)
  (general-create-definer global-leader
    :states '(normal insert emacs visual)
    :prefix normal-global-leader-key
    :non-normal-prefix non-normal-leader-key)
  (general-create-definer major-leader
    :states '(normal insert emacs visual)
    :prefix normal-major-mode-leader-key
    :non-normal-prefix non-normal-major-mode-leader-key)
  (general-nmap "SPC m" (general-simulate-key "," :which-key "major mode"))
  (global-leader 
    "f" '(:ignore t :which-key "file")
    "ff" '(helm-find-files :which-key "open file")
    "fs" '(save-buffer :which-key "save")
    "fr" '(helm-recentf :which-key "recent file")
    "fd" '(:ignore t :which-key "dot files")
    "fde" '(herl-open-emacs-org :which-key "open Emacs.org")
    "w" '(:ignore t :which-key "window")
    "ww" '(other-window :which-key "other window")
    "wh" '(evil-window-left :which-key "window below")
    "wn" '(evil-window-down :which-key "window down")
    "we" '(evil-window-up :which-key "window up")
    "wi" '(evil-window-right :which-key "window right")
    "w/" '(split-window-right :which-key "split right")
    "w-" '(split-window-below :which-key "split below")
    "wd" '(delete-window :which-key "delete window")
    "wm" '(delete-other-windows :which-key "maxmize")
    "b" '(:ignore t :which-key "buffer")
    "bb" '(helm-mini :which-key "buffer list")
    "bn" '(next-buffer :which-key "next buffer")
    "be" '(previous-buffer :which-key "previous buffer")
    "q" '(save-buffers-kill-terminal :which-key "quit")
    "SPC" '(helm-M-x :which-key "M-x")
    )
  )

(message "general inided!")
