Emacs.org
** winum
   Initialize winum
   - keybindings with general
   - turn on winum-mode after startup
   #+begin_src emacs-lisp :tangle ~/.emacs.d/init-before.el
     (use-package winum
       :config
       (winum-mode)
       (general-define-key
	:states '(normal visual insert emacs)
	:prefix "SPC"
	:non-normal-prefix "M-m"
	"1" '(winum-select-window-1 :which-key "window 1")
	"2" '(winum-select-window-2 :which-key "window 2")
	"3" '(winum-select-window-3 :which-key "window 3")
	"4" '(winum-select-window-4 :which-key "window 4")
	"5" '(winum-select-window-5 :which-key "window 5")
	"6" '(winum-select-window-6 :which-key "window 6")
	)
       )

     (message "winum inided!")
   #+end_src
** treemacs
   Initialize treemacs.
   - evil integration
   - keybindings with general (open, close, switch to treeview)
   #+begin_src emacs-lisp :tangle ~/.emacs.d/init-before.el
     (use-package treemacs-evil
       :config
       (defun herl-close-tree ()
	 "close tree view"
	 (interactive)
	 (treemacs-select-window)
	 (treemacs-quit)
	 )
       (general-define-key
	:states '(normal visual insert emacs)
	:prefix "SPC"
	:non-normal-prefix "M-m"
	"ft" '(:ignore t :which-key "file tree")
	"ftt" '(treemacs :which-key "open file tree")
	"fts" '(treemacs-select-window :which-key "switch to tree")
	"ftq" '(herl-close-tree :which-key "quit tree")
	)
       )
     (message "treemacs inited!")
   #+end_src
** yasnippet
   Initialize yasnippet
   - use github rep (support for regexp as trigger)
   - turn on global
   #+begin_src emacs-lisp :tangle ~/.emacs.d/init-before.el
     (quelpa '(yasnippet :fetcher git :url "https://github.com/HerculeWu/yasnippet.git"))
     (yas-global-mode)

     (message "yasnippet inited!")
   #+end_src
** magit
   Initialize magit mode
   - keybindings with general
   - keybindings for edit commit
   #+begin_src emacs-lisp :tangle ~/.emacs.d/init-before.el
     (use-package magit)
     (global-leader
       "g" '(:ignore t :which-key "git")
       "gg" '(magit-status :which-key "status")
       "gs" '(magit-stage-file :which-key "stage")
       "gu" '(magit-unstage-file :which-key "unstage")
       )
     (dolist (state '(normal motion))
       (evil-define-key state with-editor-mode-map
	 (concat normal-major-mode-leader-key normal-major-mode-leader-key) 'with-editor-finish
	 (concat normal-major-mode-leader-key "c") 'with-editor-finish
	 (concat normal-major-mode-leader-key "k") 'with-editor-cancel
	 )
       )

     (message "magit inited!")
   #+end_src
** lsp
   Initialize lsp
   - lsp-ui integration
   - helm-lsp integration
   - lsp-treemacs integration
   - delay 0.5s
   - turn off auto guss root
   - turn on sideline show diagnostics
   - turn on sideline show hover
   - turn on show doc
   - show doc at point
   - global keybinding with leader key SPC-l
   #+begin_src emacs-lisp :tangle ~/.emacs.d/init-before.el
     (use-package lsp-mode)
     (use-package lsp-ui :commands lsp-ui-mode)
     (use-package helm-lsp :commands helm-lsp-workspace-symbol)
     (use-package lsp-treemacs :commands lsp-treemacs-errors-list)
     (setq lsp-completion-provider :capf)
     (setq lsp-idle-delay 0.500)
     (setq lsp-auto-guess-root nil)
     (setq lsp-ui-sideline-show-diagnostics t)
     (setq lsp-ui-sideline-show-hover t)
     (setq lsp-ui-doc-enable t)
     (setq lsp-ui-doc-position 'at-point)
     (setq lsp-restart 'ignore)
     (global-leader
       "l" '(:ignore t :which-key "lsp")
       "l=" '(:ignore t :which-key "format")
       "lf" '(:ignore t :which-key "workspace")
       "lg" '(:ignore t :which-key "goto")
       "lt" '(:ignore t :which-key "tree")
       "la" '(:ignore t :which-key "action")
       "lh" '(:ignore t :which-key "help")
       "lr" '(:ignore t :which-key "rename")
       "ls" '(:ignore t :which-key "server")
       "lm" '(lsp-ui-imenu :which-key "imenu")
       "laa" '(lsp-execute-code-action :which-key "execute code action")
       "lah" '(lsp-document-highlight :which-key "highlight")
       "lro" '(lsp-organize-imports :which-key "organize imports")
       "lrr" '(lsp-rename :which-key "rename")
       "lhg" '(lsp-ui-doc-glance :which-key "doc glance")
       "lhh" '(lsp-describe-thing-at-point :which-key "describe thing at point")
       "lhs" '(lsp-signature-activate :which-key "signature activate")
       "lge" '(lsp-treemacs-errors-list :which-key "treemacs errors list")
       "lgg" '(lsp-find-definition :which-key "defination")
       "lgh" '(lsp-treemacs-call-hierarchy :which-key "treemacs call hierarchy")
       "lgr" '(lsp-find-references :which-key "references")
       "ltd" '(lsp-modeline-diagnostics-mode :which-key "modeline diagnostics mode")
       "ltl" '(lsp-toggle-trace-io :which-key "toggle trace io")
       "lts" '(lsp-ui-sideline-mode :which-key "ui sideline mode")
       "ltt" '(lsp-treemacs-sync-mode :which-key "treemacs sync mode")
       "lta" '(lsp-modeline-code-actions-mode :which-key "modeline code actions mode")
       "ltb" '(lsp-headerline-breadcrumb-mode :which-key "headerline breadcrumb mode")
       "ltd" '(lsp-ui-doc-mode :which-key "ui doc mode")
       "lth" '(lsp-toggle-symbol-highlight :which-key "toggle symbol highlight")
       "ltl" '(lsp-lens-mode :which-key "lens mode")
       "lts" '(lsp-toggle-signature-auto-activate :which-key "toggle signature auto activate")
       "lfa" '(lsp-workspace-folders-add :which-key "folders add")
       "lfb" '(lsp-workspace-blacklist-remove :which-key "blacklist remove")
       "lfr" '(lsp-workspace-folders-remove :which-key "folders remove")
       "l==" '(lsp-format-buffer :which-key "buffer")
       "l=r" '(lsp-format-region :which-key "region")
       "lsd" '(lsp-disconnect :which-key "disconnect")
       "lsd" '(lsp-describe-session :which-key "describe session")
       "lsq" '(lsp-workspace-shutdown :which-key "workspace shutdown")
       "lsr" '(lsp-workspace-restart :which-key "workspace restart")
       "lss" '(lsp :which-key "start/restart")
     )

     (message "lsp inited!")
   #+end_src 
** highlight-indent-guides
   highlight indent
   - turn on in progn-mode
   - use bitmap method
   #+begin_src emacs-lisp :tangle ~/.emacs.d/init-before.el
     (use-package highlight-indent-guides
       :ensure t
       :hook (prog-mode . highlight-indent-guides-mode)
       :config
       (setq highlight-indent-guides-method 'bitmap))

     (message "highlight-indent-guides inited!")
   #+end_src
** info-colors
   Show info message with colors
   #+begin_src emacs-lisp :tangle ~/.emacs.d/init-before.el
     (use-package info-colors 
       :ensure t 
       :hook ('Info-selection-hook . 'info-colors-fontify-node))

     (message "info-colors inited!")
   #+end_src
** nyan-mode
   Cat will tall me when I can take a break!
   #+begin_src emacs-lisp :tangle ~/.emacs.d/init-before.el
     (use-package nyan-mode
       :ensure t
       :hook (after-init . nyan-mode)
       :config
       (setq nyan-wavy-trail t
		     nyan-animate-nyancat t))

     (message "cat is with you now!")
   #+end_src 
** rainbow-delimiters
   colorful parents
   #+begin_src emacs-lisp :tangle ~/.emacs.d/init-before.el
     (use-package rainbow-delimiters
       :hook (prog-mode . rainbow-delimiters-mode))
   #+end_src
** company
   Initialize company.
   - delay 0s
   - turn on selection wrap (circle seclecte)
   - minimun prefix length = 3
   - turn global
   - remap C-n C-e and RET
   - company-box: use some icons
   *Note:* This can not dump, will have some load path issus, I don't know how to fix it:(
   #+begin_src emacs-lisp :tangle ~/.emacs.d/init-after.el
     (use-package company
     :config
     (setq company-idle-delay 0)
     (setq company-selection-wrap-around t)
     (setq company-minimum-prefix-length 3)
     (company-tng-configure-default)
     (global-company-mode)
     :bind (
	    (:map company-active-map
		  ("RET" . company-complete-selection)
		  ("C-n" . company-select-next)
		  ("C-e" . company-select-previous)
		  )
	    )
     )
     (use-package company-box
       :hook (company-mode . company-box-mode))
   #+end_src
** doom-mode-line
   Initialize doom-modeline
   *Note:* Will need M-x all-the-icons-install-fonts at first startup
   This can only load after
   #+begin_src emacs-lisp :tangle ~/.emacs.d/init-after.el
     (use-package all-the-icons)

     (use-package doom-modeline
       :config
       (doom-modeline-mode 1)
       (setq doom-modeline-icon (display-graphic-p))
       (setq doom-modeline-major-mode-icon t)
       (setq doom-modeline-minor-modes nil)
       (setq doom-modeline-lsp t)
       )
   #+end_src
** dashboard
   Initialize dashboard (new welcome buffer)
   *Note:* Can not be dumped!
   #+begin_src emacs-lisp :tangle ~/.emacs.d/init-after.el
     (use-package page-break-lines
       :ensure t
       :hook (after-init . page-break-lines-mode))

     (use-package dashboard
       :ensure t
       :config
       (dashboard-setup-startup-hook)
       (setq dashboard-banner-logo-title "welcom back!")
       (setq dashboard-center-content t)
       (setq dashboard-set-heading-icons t) 
       (setq dashboard-set-navigator t)
       )

     (message "dashboard inited!")
   #+end_src
** dired
   #+begin_src emacs-lisp :tangle ~/.emacs.d/init-before.el
     (use-package dired
       :ensure nil)
     (use-package all-the-icons-dired)
   #+end_src
