init-after.el

(use-package vterm
  :config
  (setq vterm-max-scrollback 10000))

(setq gc-cons-threshold 100000000)

(setq read-process-output-max (* 1024 1024))

(setq garbage-collection-messages t)

(defvar k-gc-timer
  (run-with-idle-timer 15 t
		       'garbage-collect))

(setq xwidget-webkit-enable-plugins t)
