init-before.el

(use-package git-gutter
  :config
  (global-git-gutter-mode +1)
  (custom-set-variables
   '(git-gutter:update-interval 1)
   '(git-gutter:added-sign "+")
   '(git-gutter:deleted-sign "-")
   '(git-gutter:modified-sign "~")
   ))

(use-package org
  :config
  (setq org-ellipsis " ▼")
  (setq org-hide-emphasis-markers t)
  )
(use-package evil-org
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))
(use-package org-bullets
  :custom
  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))
(add-hook 'org-mode-hook
	  (lambda ()
	    (progn
	      (evil-org-mode)
	      (org-bullets-mode)
	      (herl/evil-colemak-setup)
	      (major-leader 'org-mode-map
		"," 'org-ctrl-c-ctrl-c
		"*" 'org-ctrl-c-star
		"*" 'org-ctrl-c-star
		"RET" 'org-ctrl-c-ret
		"-" 'org-ctrl-c-minus
		"'" 'org-edit-special
		"^" 'org-sort
		"/" 'org-sparse-tree
		"." 'org-time-stamp
		"!" 'org-time-stamp-inactive
		"a" 'org-agenda
		"b" 'org-tree-to-indirect-buffer
		"A" 'org-archive-subtree
		"c" 'org-capture
		"C" 'evil-org-recompute-clocks
		"d" 'org-deadline
		"D" 'org-insert-drawer
		"e" 'org-export-dispatch
		"f" 'org-set-effort
		"K" 'org-clock-in
		"l" 'org-open-at-point
		"O" 'org-clock-out
		"P" 'org-set-property
		"q" 'org-clock-cancel
		"R" 'org-refile
		"s" 'org-schedule
		"T" 'org-show-todo-tree
		"I" 'org-shiftright
		"H" 'org-shiftleft
		"E" 'org-shiftup
		"N" 'org-shiftdown
		"B" '(:ignore t :wk "babel")
		"B I" 'org-babel-view-src-block-info
		"B a" 'org-babel-sha1-hash
		"B b" 'org-babel-execute-buffer
		"B c" 'org-babel-check-src-block
		"B d" 'org-babel-demarcate-block
		"B e" 'org-babel-execute-maybe
		"B f" 'org-babel-tangle-file
		"B g" 'org-babel-goto-named-src-block
		"B h" 'org-babel-describe-bindings
		"B i" 'org-babel-lob-ingest
		"B j" 'org-babel-insert-header-arg
		"B k" 'org-babel-remove-result-one-or-many
		"B l" 'org-babel-load-in-session
		"B n" 'org-babel-next-src-block
		"B o" 'org-babel-open-src-block-result
		"B p" 'org-babel-previous-src-block
		"B r" 'org-babel-goto-named-result
		"B s" 'org-babel-execute-subtree
		"B t" 'org-babel-tangle
		"B u" 'org-babel-goto-src-block-head
		"B v" 'org-babel-expand-src-block
		"B x" 'org-babel-do-key-sequence-in-edit-buffer
		"B z" 'org-babel-switch-to-session-with-code
		)
	      )))

(defun herl/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
	visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . herl/org-mode-visual-fill))

(defun org-babel-auto-tangle ()
  (when (string-equal (buffer-file-name)
		      (expand-file-name "~/.emacs.d/Emacs.org"))
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'org-babel-auto-tangle)))

(message "org inited!")

(setq TeX-auto-save t)
(setq TeX-parse-self t)
(setq-default TeX-master nil)

(defun latex/change-env ()
  (interactive)
  (LaTeX-environment t))
(defun latex/font-bold () (interactive) (TeX-font nil ?\C-b))
(defun latex/font-code () (interactive) (TeX-font nil ?\C-t))
(defun latex/font-emphasis () (interactive) (TeX-font nil ?\C-e))
(defun latex/font-italic () (interactive) (TeX-font nil ?\C-i))
(defun latex/font-clear () (interactive) (TeX-font nil ?\C-d))
(defun latex/font-oblique () (interactive) (TeX-font nil ?\C-s))

(add-hook 'LaTeX-mode-hook
	  (lambda ()
	    (progn
	      (major-leader 'LaTeX-mode-map
		"p" '(:ignore t :wk "preview")
		"p e" '(preview-environment :wk "environment")
		"p l" '(preview-region :wk "region")
		"p s" '(preview-section :wk "section")
		"p p" '(preview-at-point :wk "at point")
		"p c" '(:ignore t :wk "clear preview")
		"p c b" '(preview-clearout-buffer :wk "buffer")
		"p c s" '(preview-clearout-section :wk "section")
		"p c p" '(preview-clearout-at-point :wk "at point")
		"e" '(:ignore t :wk "environment")
		"e i" '(LaTeX-environment :wk "insert")
		"e c" '(latex/change-env :wk "change")
		"f" '(:ignore t :wk "insert font")
		"fb"  '(latex/font-bold :wk "bold")
		"fc"  '(latex/font-code :wk "code")
		"fe"  '(latex/font-emphasis :wk "emphasis")
		"fi"  '(latex/font-italic :wk "italic")
		"fr"  '(latex/font-clear :wk "clear")
		"fo"  '(latex/font-oblique :wk "oblique")
		)
	    )
	  )
 )

(message "latex inited!")

(use-package python-mode
  :hook (python-mode . lsp)
  :custom
  (python-shell-interpreter "python3"))
(use-package py-isort)

(use-package julia-mode)

(quelpa '(lsp-julia :fetcher github
		    :repo "non-Jedi/lsp-julia"
		    :files (:defaults "languageserver")))

(add-hook 'julia-mode-hook #'lsp)

(message "Julia inited!")

(global-leader
  "a" '(:ignore t :wk "app")
  "as" '(:ignore t :wk "shell")
  "ase" '(eshell :wk "eshell")
  "asv" '(vterm :wk "vterm")
  )

(message "vterm inited")

(defun herl/open-google ()
  (interactive)
  (xwidget-webkit-browse-url "https://www.google.com" t)
  )
(global-leader
  "aw" '(:ignore t :wk "webkit")
  "awg" '(herl/open-google :wk "google")
  "awu" '(xwidget-webkit-browse-url :wk "open url")
  )

(defun herl/webkit-open-local-file (fpath)
  (interactive "fEnter file path: ")
  (when (member (substring fpath -4 nil) '("html" ".pdf"))
    (xwidget-webkit-browse-url
     (concat "file://" (expand-file-name fpath)))
    )
  )

(global-leader
  "awf" '(herl/webkit-open-local-file :wk "open loacl html"))
